In [8]:
import pandas as pd
c=pd.DataFrame([2,3,4,6])
c

   0
0  2
1  3
2  4
3  6

In [6]:
import pandas as pd
n=pd.DataFrame([2,3,4,6],columns=['a'])

In [7]:
n

   a
0  2
1  3
2  4
3  6

In [22]:
lst = ['qw', 'er', 'ty', 'ui', 'op', 'zx', 'cv']
df = pd.DataFrame(lst)
df.columns=['nme']
#df.nme
df.columns.tolist()

['nme']

In [24]:
df['nme']

0    qw
1    er
2    ty
3    ui
4    op
5    zx
6    cv
Name: nme, dtype: object

In [26]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
df = pd.DataFrame(data)
print(df)

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [37]:
import os
os.chdir('C:\\Users\\PADAM\\Desktop')
data = pd.read_csv("exercise.csv")
first = data["number"]
type(first)

pandas.core.series.Series

In [38]:
first

0      we
1     wer
2    wert
3       r
4       u
5       h
6       4
7       g
8       n
Name: number, dtype: object

In [39]:
first.shape

(9,)

In [40]:
first.ndim

1

In [42]:
lst = ['qw', 'er', 'ty', 'ui', 'op', 'zx', 'cv']
df = pd.DataFrame(lst)
df.columns=['nme']
df

  nme
0  qw
1  er
2  ty
3  ui
4  op
5  zx
6  cv

In [43]:
df['num']=['66','78','88','89','87','62','47']

In [44]:
df

  nme num
0  qw  66
1  er  78
2  ty  88
3  ui  89
4  op  87
5  zx  62
6  cv  47

In [45]:
df

  nme num
0  qw  66
1  er  78
2  ty  88
3  ui  89
4  op  87
5  zx  62
6  cv  47

In [47]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
df = pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [51]:
df.loc[[0,2]]

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
2  Gaurav   22  Allahabad           MCA

In [59]:
df.loc[[0,2],['Name','Age']]

     Name  Age
0     Jai   27
2  Gaurav   22

In [57]:
df.iloc[[0,2],[1,3]]

   Age Qualification
0   27           Msc
2   22           MCA

In [53]:
df.iloc[[0,2],[0,2]]

     Name    Address
0     Jai      Delhi
2  Gaurav  Allahabad

In [62]:
df.iloc[:,:4]

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [63]:
df.iloc[-1::-1]

     Name  Age    Address Qualification
3    Anuj   32    Kannauj           Phd
2  Gaurav   22  Allahabad           MCA
1  Princi   24     Kanpur            MA
0     Jai   27      Delhi           Msc

In [66]:
df.iloc[-1::-1,-1::-1]

  Qualification    Address  Age    Name
3           Phd    Kannauj   32    Anuj
2           MCA  Allahabad   22  Gaurav
1            MA     Kanpur   24  Princi
0           Msc      Delhi   27     Jai

In [67]:
df.Age.tolist()

[27, 24, 22, 32]

In [70]:
df.Age.values

array([27, 24, 22, 32], dtype=int64)

In [74]:
df.iloc[1,2]='Kanpur'

In [75]:
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [76]:
df.iloc[1,1]=78

In [77]:
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   78     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [78]:
df.Age*2

0     54
1    156
2     44
3     64
Name: Age, dtype: int64

In [79]:
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   78     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [80]:
df['mr']=['78','47','63','98']

In [81]:
df

     Name  Age    Address Qualification  mr
0     Jai   27      Delhi           Msc  78
1  Princi   78     Kanpur            MA  47
2  Gaurav   22  Allahabad           MCA  63
3    Anuj   32    Kannauj           Phd  98

In [25]:
import pandas as pd
data = {'age':[27, 24, 22, 32],
        'mr':['78', '63', '68', '78']}
df = pd.DataFrame(data)
df

   age  mr
0   27  78
1   24  63
2   22  68
3   32  78

In [26]:
df['marks']=df.age/df.mr

TypeError: unsupported operand type(s) for /: 'int' and 'str'

In [78]:
df.sort_values(['age'])

   age  mr
2   22  68
1   24  63
0   27  78
3   32  78

In [79]:
df

   age  mr
0   27  78
1   24  63
2   22  68
3   32  78

In [80]:
df.sort_values('age',inplace=True)

In [81]:
df

   age  mr
2   22  68
1   24  63
0   27  78
3   32  78

In [82]:
df

   age  mr
2   22  68
1   24  63
0   27  78
3   32  78

In [84]:
df.reset_index()

   index  age  mr
0      2   22  68
1      1   24  63
2      0   27  78
3      3   32  78

In [85]:
df.reset_index(drop=True,inplace=True)

In [86]:
df

   age  mr
0   22  68
1   24  63
2   27  78
3   32  78

In [92]:
df.sort_index(axis=1,inplace=True)

In [93]:
df

   age  mr
0   22  68
1   24  63
2   27  78
3   32  78

In [94]:
df.sort_index(axis=0,inplace=True)
df

   age  mr
0   22  68
1   24  63
2   27  78
3   32  78

In [99]:
df.drop('age',axis=1,inplace=True)
df

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [16]:
import pandas as pd
df=pd.DataFrame ([['Jai', 'Princi', 'Gaurav', 'Anuj'],[27, 24, 22, 32],['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],['Msc', 'MA', 'MCA', 'Phd']],index=['a','b','c','d'])
print(df)

       0       1          2        3
a    Jai  Princi     Gaurav     Anuj
b     27      24         22       32
c  Delhi  Kanpur  Allahabad  Kannauj
d    Msc      MA        MCA      Phd

In [20]:
df.iloc[[0,2],[0,2]]

       0          2
a    Jai     Gaurav
c  Delhi  Allahabad

In [33]:
import pandas as pd
df=pd.DataFrame([['abc',22,2344,'delhi'],['xyz',45,2344,'lucknow'],['qbc',23,2004,'noida']],index=range(1,4))
print(df)

     0   1     2        3
1  abc  22  2344    delhi
2  xyz  45  2344  lucknow
3  qbc  23  2004    noida

In [34]:
df.columns=['name','age','salary','city']

In [35]:
df

  name  age  salary     city
1  abc   22    2344    delhi
2  xyz   45    2344  lucknow
3  qbc   23    2004    noida

In [39]:
df['marks']=df.age/df.salary
df

  name  age  salary     city     marks
1  abc   22    2344    delhi  0.009386
2  xyz   45    2344  lucknow  0.019198
3  qbc   23    2004    noida  0.011477

In [65]:
import numpy as np
import pandas as pd
df=pd.DataFrame([['abc',22,2344,'delhi'],['xyz',45,2344,'lucknow'],['qbc',23,2004,'noida']],index=range(1,4))
df.columns=['name','age','salary','city']
df['marks']=df.age/df.salary

In [67]:
def check(x):
    return np.round(x,2)
df['marks']=df.marks.apply(check)

In [68]:
df

  name  age  salary     city  marks
1  abc   22    2344    delhi   0.01
2  xyz   45    2344  lucknow   0.02
3  qbc   23    2004    noida   0.01

In [69]:
df.iloc[1,2]=1200
df

  name  age  salary     city  marks
1  abc   22    2344    delhi   0.01
2  xyz   45    1200  lucknow   0.02
3  qbc   23    2004    noida   0.01

In [73]:
df.sort_values('salary',inplace=True)

In [74]:
df

  name  age  salary     city  marks
2  xyz   45    1200  lucknow   0.02
3  qbc   23    2004    noida   0.01
1  abc   22    2344    delhi   0.01

In [77]:
df[(df.city=='delhi') | (df.age>30)]

  name  age  salary     city  marks
2  xyz   45    1200  lucknow   0.02
1  abc   22    2344    delhi   0.01

In [78]:
df[(df.city=='delhi') & (df.age>30)]

Empty DataFrame
Columns: [name, age, salary, city, marks]
Index: []

In [ ]:
df.drop('age',axi)